case/validation/validationSphereOrigin/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet   
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
    }
    sphere
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0.0001 0 0);
    }
    periodicWall
    {
        type            symmetry;
    }
    "proc.*"
    {
        type    processor;
    }
}


// ************************************************************************* //
